*** src/window_config.rs:40:9: replace WindowConfigStore::get -> Result<Option<WindowConfig>, String> with Ok(None)

*** mutation diff:
--- src/window_config.rs
+++ replace WindowConfigStore::get -> Result<Option<WindowConfig>, String> with Ok(None)
@@ -32,36 +32,17 @@
                 updated_at DATETIME DEFAULT CURRENT_TIMESTAMP
             )"
         ).map_err(|e| format!("Failed to create table: {}", e))?;
 
         Ok(Self { conn: Mutex::new(conn) })
     }
 
     pub fn get(&self, window_id: &str) -> Result<Option<WindowConfig>, String> {
-        let conn = self.conn.lock().map_err(|e| e.to_string())?;
-        let mut stmt = conn
-            .prepare("SELECT window_id, width, height, x, y FROM window_configs WHERE window_id = ?1")
-            .map_err(|e| e.to_string())?;
-
-        let result = stmt.query_row(params![window_id], |row| {
-            Ok(WindowConfig {
-                window_id: row.get(0)?,
-                width: row.get(1)?,
-                height: row.get(2)?,
-                x: row.get(3)?,
-                y: row.get(4)?,
-            })
-        });
-
-        match result {
-            Ok(config) => Ok(Some(config)),
-            Err(rusqlite::Error::QueryReturnedNoRows) => Ok(None),
-            Err(e) => Err(e.to_string()),
-        }
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn save(&self, config: &WindowConfig) -> Result<(), String> {
         let conn = self.conn.lock().map_err(|e| e.to_string())?;
 
         let updated = conn.execute(
             "UPDATE window_configs SET width = ?1, height = ?2, x = ?3, y = ?4, updated_at = CURRENT_TIMESTAMP WHERE window_id = ?5",
             params![config.width, config.height, config.x, config.y, config.window_id],

---- window_config::tests::multiple_windows_independent stdout ----

thread 'window_config::tests::multiple_windows_independent' panicked at src\window_config.rs:200:45:
called `Option::unwrap()` on a `None` value

---- window_config::tests::save_and_get_without_position stdout ----

thread 'window_config::tests::save_and_get_without_position' panicked at src\window_config.rs:132:49:
called `Option::unwrap()` on a `None` value

---- window_config::tests::save_updates_existing stdout ----

thread 'window_config::tests::save_updates_existing' panicked at src\window_config.rs:158:49:
called `Option::unwrap()` on a `None` value

failures:
    window_config::tests::multiple_windows_independent
    window_config::tests::save_and_get_with_position
    window_config::tests::save_and_get_without_position
    window_config::tests::save_updates_existing

test result: FAILED. 3 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
