*** src/window_config.rs:63:9: replace WindowConfigStore::save -> Result<(), String> with Ok(())

*** mutation diff:
--- src/window_config.rs
+++ replace WindowConfigStore::save -> Result<(), String> with Ok(())
@@ -55,31 +55,17 @@
         match result {
             Ok(config) => Ok(Some(config)),
             Err(rusqlite::Error::QueryReturnedNoRows) => Ok(None),
             Err(e) => Err(e.to_string()),
         }
     }
 
     pub fn save(&self, config: &WindowConfig) -> Result<(), String> {
-        let conn = self.conn.lock().map_err(|e| e.to_string())?;
-
-        let updated = conn.execute(
-            "UPDATE window_configs SET width = ?1, height = ?2, x = ?3, y = ?4, updated_at = CURRENT_TIMESTAMP WHERE window_id = ?5",
-            params![config.width, config.height, config.x, config.y, config.window_id],
-        ).map_err(|e| e.to_string())?;
-
-        if updated == 0 {
-            conn.execute(
-                "INSERT INTO window_configs (window_id, width, height, x, y) VALUES (?1, ?2, ?3, ?4, ?5)",
-                params![config.window_id, config.width, config.height, config.x, config.y],
-            ).map_err(|e| e.to_string())?;
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn delete(&self, window_id: &str) -> Result<(), String> {
         let conn = self.conn.lock().map_err(|e| e.to_string())?;
         conn.execute(
             "DELETE FROM window_configs WHERE window_id = ?1",
             params![window_id],
         ).map_err(|e| e.to_string())?;

---- window_config::tests::multiple_windows_independent stdout ----

thread 'window_config::tests::multiple_windows_independent' panicked at src\window_config.rs:205:45:
called `Option::unwrap()` on a `None` value

---- window_config::tests::save_updates_existing stdout ----

thread 'window_config::tests::save_updates_existing' panicked at src\window_config.rs:163:49:
called `Option::unwrap()` on a `None` value

---- window_config::tests::save_and_get_without_position stdout ----

thread 'window_config::tests::save_and_get_without_position' panicked at src\window_config.rs:137:49:
called `Option::unwrap()` on a `None` value

failures:
    window_config::tests::multiple_windows_independent
    window_config::tests::save_and_get_with_position
    window_config::tests::save_and_get_without_position
    window_config::tests::save_updates_existing

test result: FAILED. 3 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
