*** src/window_config.rs:70:20: replace == with != in WindowConfigStore::save

*** mutation diff:
--- src/window_config.rs
+++ replace == with != in WindowConfigStore::save
@@ -62,17 +62,17 @@
     pub fn save(&self, config: &WindowConfig) -> Result<(), String> {
         let conn = self.conn.lock().map_err(|e| e.to_string())?;
 
         let updated = conn.execute(
             "UPDATE window_configs SET width = ?1, height = ?2, x = ?3, y = ?4, updated_at = CURRENT_TIMESTAMP WHERE window_id = ?5",
             params![config.width, config.height, config.x, config.y, config.window_id],
         ).map_err(|e| e.to_string())?;
 
-        if updated == 0 {
+        if updated != /* ~ changed by cargo-mutants ~ */ 0 {
             conn.execute(
                 "INSERT INTO window_configs (window_id, width, height, x, y) VALUES (?1, ?2, ?3, ?4, ?5)",
                 params![config.window_id, config.width, config.height, config.x, config.y],
             ).map_err(|e| e.to_string())?;
         }
 
         Ok(())
     }

---- window_config::tests::save_and_get_without_position stdout ----

thread 'window_config::tests::save_and_get_without_position' panicked at src\window_config.rs:151:49:
called `Option::unwrap()` on a `None` value

---- window_config::tests::multiple_windows_independent stdout ----

thread 'window_config::tests::multiple_windows_independent' panicked at src\window_config.rs:219:45:
called `Option::unwrap()` on a `None` value

---- window_config::tests::save_and_get_with_position stdout ----

thread 'window_config::tests::save_and_get_with_position' panicked at src\window_config.rs:132:55:
called `Option::unwrap()` on a `None` value

failures:
    window_config::tests::multiple_windows_independent
    window_config::tests::save_and_get_with_position
    window_config::tests::save_and_get_without_position
    window_config::tests::save_updates_existing

test result: FAILED. 3 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
