*** src/window_config.rs:81:9: replace WindowConfigStore::delete -> Result<(), String> with Ok(())

*** mutation diff:
--- src/window_config.rs
+++ replace WindowConfigStore::delete -> Result<(), String> with Ok(())
@@ -73,22 +73,17 @@
                 params![config.window_id, config.width, config.height, config.x, config.y],
             ).map_err(|e| e.to_string())?;
         }
 
         Ok(())
     }
 
     pub fn delete(&self, window_id: &str) -> Result<(), String> {
-        let conn = self.conn.lock().map_err(|e| e.to_string())?;
-        conn.execute(
-            "DELETE FROM window_configs WHERE window_id = ?1",
-            params![window_id],
-        ).map_err(|e| e.to_string())?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- window_config::tests::delete_removes_config stdout ----

thread 'window_config::tests::delete_removes_config' panicked at src\window_config.rs:192:9:
assertion failed: result.is_none()

---- window_config::tests::multiple_windows_independent stdout ----

thread 'window_config::tests::multiple_windows_independent' panicked at src\window_config.rs:220:9:
assertion failed: store.get("win_a").unwrap().is_none()

failures:
    window_config::tests::delete_removes_config
    window_config::tests::multiple_windows_independent

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
